10/data/attachments/596c5ddf1e69a84e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Nicholas_but_Actions_54795_4</nif:username>
            <nif:friendToBeRequested>soap_actions_87503369-b0b0-4cf9-ba8a-ccf7404b5ec5</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>